using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using PKMN_CALC.Master;

namespace PKMN_CALC.Calc
{
    /// <summary>
    /// ステータス計算クラス
    /// </summary>
    public class CalcStatus
    { 
        //共通クラス****************************************************************************************************************************************************

        //必要なデータをセット
        public CalcStatus()
        {
            //攻撃側ポケモン---------------------------------------------------------------------------------------------------------------------------------------------
            //わざ(威力・特殊/物理・命中率・味方ポケモンのタイプ一致)
            //攻撃数値(ポケモンの性格・種族値・個体値・努力値)
            //ランク(A/C)
            //道具(火力系)
            //特性(火力系)
            //その他(てだすけ・さきどり・そうでん・ハロウィン・バッテリー・やけど・じゅうでん・フラワーギフト・もりののろい)
            //急所            

            //防御側ポケモン---------------------------------------------------------------------------------------------------------------------------------------------
            //防御数値(ポケモンの性格・種族値・個体値・努力値)
            //ランク(B/D)
            //道具(耐久系)
            //特性(耐久系)
            //その他(リフレクター・ひかりのかべ・まもる・みずあそび・みやぶる・でんじふゆう・ハロウィン・フレンドガード・どろあそび・ミラクルアイ・フラワーギフト・もりののろい)

            //攻守決定してから決まる事象----------------------------------------------------------------------------------------------------------------------------------
            //タイプ相性(わざ・敵ポケモンより自動決定)

            //cMI,cErrorLogを使える
        }
    }
}
